import Image from 'next/image';

const cards = [
  {
    id: 1,
    title: 'سامانه پرداخت الکترونیکی عوارض',
    body: 'ناواکو، پیشگام در تحول دیجیتال حمل‌ونقل، برای نخستین‌بار در کشور سامانه هوشمند پرداخت الکترونیکی عوارض (ETC) را با همکاری وزارت راه و شهرسازی و بانک مسکن اجرا کرده و گامی مؤثر در توسعه زیرساخت‌های هوشمند ایران برداشته است',
    img: '/static/images/home/car-1.png',
    items: [
      'اجرای سامانه ETC بدون نیاز به توقف خودرو در آزادراه تهران–پردیس',
      'تسهیل عبور و مرور، کاهش زمان سفر و ارتقاء تجربه رانندگی',
      'کاهش مصرف سوخت و آلودگی هوا با حذف توقف‌های غیرضروری',
      'حرکت به‌سوی شهروند الکترونیک و حمل‌ونقل پایدار',
      'اتصال یکپارچه با سامانه‌های بانکی و نظارتی برای امنیت و شفافیت مالی',
    ],
  },
  {
    id: 2,
    title: 'سامانه معاینه فنی خودروهای سنگین و نیمه سنگین',
    body: 'سامانه جامع «معاینه فنی خودروهای سنگین و نیمه‌سنگین» با هدف ارتقاء ایمنی جاده‌ای، کاهش آلاینده‌ها و استانداردسازی فرآیندهای فنی، توسط ناواکو طراحی، توسعه و پشتیبانی شده است.',
    img: '/static/images/home/car-2.png',
    items: [
      'بهینه‌سازی کامل فرآیند معاینه فنی مطابق با استانداردهای ملی',
      'ثبت و مدیریت اطلاعات مراکز معاینه و ناوگان خودروها به‌صورت متمرکز',
      'صدور گواهی رسمی و آنلاین با قابلیت اعتبارسنجی در لحظه',
      'انجام تست‌های تخصصی با تجهیزات دقیق و ثبت نتایج به‌صورت امن و قابل پیگیری',
      'پشتیبانی از گزارش‌گیری تحلیلی برای نهادهای نظارتی و مدیریتی',
    ],
  },
  {
    id: 3,
    title: 'توسعه کیوسک دیجیتال',
    body: '',
    img: '/static/images/home/pr-2.png',
    items: [
      'تولید کیوسک‌های بانکی هوشمند منطبق با استاندارد بین‌المللی ISO8583 و فیلدهای بومی‌سازی‌شده بانک مرکزی',
      'مجهز به تجهیزات پیشرفته بانکی شامل کارت‌خوان، صفحه‌کلید امن، چاپگر رسید و بارکدخوان یک‌بعدی و دوبعدی',
      'ارائه طیف متنوعی از خدمات بانکی با رعایت کامل الزامات امنیتی',
      'توسعه سیستم‌های مانیتورینگ و کنترل مرکزی آنلاین جهت مدیریت و نگهداری بهینه کیوسک‌ها',
      'افزایش کارایی شبکه‌های بانکی و کاهش چشمگیر هزینه‌های پشتیبانی',
    ],
  },
  {
    id: 4,
    title: 'سامانه آموزشی LMS',
    body:
      'سامانه «آکادمی هوش بانکی ناواکو» بستری جامع برای آموزش تخصصی در حوزه‌های مالی، بانکی و فناوری‌های نوین است که امکان برگزاری دوره‌ها و کارگاه‌های آموزشی به‌صورت حضوری و آنلاین را برای کارکنان و مدیران مجموعه فراهم می‌کند.\n' +
      'از طریق این سامانه، کاربران می‌توانند به تقویم دوره‌ها، اطلاعات اساتید، سرفصل‌ها و کلاس‌های پیش‌رو دسترسی داشته باشند. همچنین اساتید می‌توانند کلاس‌های آنلاین خود را به‌صورت تعاملی برگزار کرده و محتوای آموزشی را در محیطی یکپارچه و هوشمند ارائه دهند.',
    img: '/static/images/home/pr-3.png',
    items: [],
  },
  {
    id: 5,
    title: 'تامین و پشتیبانی دستگاه‌های پوز',
    body: 'ناواکو ارائه‌دهنده راهکارهای نوین فناوری و اطلاعات بانکی با تامین و پشتیبانی کامل تجهیزات پرداخت الکترونیکی',
    img: '/static/images/home/pr-4.png',
    items: [
      'صرفه‌جویی در هزینه‌های چاپ و توزیع اسکناس',
      'رونق تجارت الکترونیک',
      'افزایش امنیت تراکنش‌ها',
      'امکان دریافت مبالغ بالا بدون ریسک چک‌های مسروقه یا جعلی',
    ],
  },
  {
    id: 6,
    title: 'وبسایت کارگزاری بانک مسکن',
    body: 'ناواکو با بهره‌گیری از تخصص و تجربه خود، پلتفرمی امن، مدرن و کاربرپسند برای کارگزاری بانک مسکن طراحی کرده که دسترسی سریع و آسان به خدمات متنوع بازار سرمایه را فراهم می‌آورد.',
    img: '/static/images/home/pr-5.png',
    items: [
      'دسترسی سریع و آسان به خدمات بورس اوراق بهادار، کالا، انرژی و مشتقات',
      'رابط کاربری ساده و تجربه بدون پیچیدگی',
      'دریافت کد معاملاتی به‌صورت آنلاین',
      'مدیریت هوشمند سرمایه‌گذاری و سود روزشمار',
      'پشتیبانی ۷/۲۴ و خدمات باشگاه مشتریان ویژه',
      'برنامه «مسکن جونیور» برای آموزش سواد مالی و سرمایه‌گذاری آسان به نسل جوان',
    ],
  },
  {
    id: 7,
    title: 'سامانه داشبورد مدیریتی',
    body:
      'سامانه «داشبورد مدیریتی گروه مالی بانک مسکن» در فاز نخست با هدف تسهیل اطلاع‌رسانی جلسات و دریافت امضای الکترونیکی شرکت‌کنندگان در جلسات گروه مالی و شرکت‌های زیرمجموعه طراحی و اجرا شد.\n' +
      'در فاز دوم، تمرکز سامانه بر ارائه گزارش‌های عملکرد شرکت‌ها و کمیته‌های تخصصی، تهیه و نمایش آمار و نمودارهای مدیریتی و تحلیل داده‌های مالی دوره‌ای است تا فرآیند تصمیم‌گیری در سطح مدیریتی با دقت و سرعت بیشتری انجام پذیرد.',
    img: '/static/images/home/pr-6.png',
    items: [],
  },
  {
    id: 8,
    title: 'وبسایت کارگزاری بانک مسکن',
    body: " 'سامانه «داشبورد مدیریتی گروه مالی بانک مسکن» در فاز نخست با هدف تسهیل اطلاع‌رسانی جلسات و دریافت امضای الکترونیکی شرکت‌کنندگان در جلسات گروه مالی و شرکت‌های زیرمجموعه  مدیریتی با دقت و سرعت بیشتری انجام پذیرد.',\n",
    img: '/static/images/home/pr-7.png',
    items: [],
  },
  {
    id: 9,
    title: 'زنجیره تامین مالی',
    body: 'پروژه «تأمین مالی زنجیره تولید صنعت ساختمان و بازارگاه مسکن» با هدف ارتقای سهم ابزارهای تأمین مالی زنجیره تولید، بهبود عملکرد بانک‌ها و افزایش کارایی سیاست‌های اعتباری، در راستای مأموریت بانک مسکن برای توسعه ابزارها و نهادهای مالی بخش مسکن اجرا می‌شود. این طرح از پروژه‌های راهبردی و تحول‌آفرین در نظام تأمین مالی مسکن و ساخت‌وساز کشور به‌شمار می‌رود.',
    img: '/static/images/home/pr-8.png',
    items: [],
  },
];

// eslint-disable-next-line @typescript-eslint/explicit-function-return-type
export default function Products() {
  return (
    <>
      <section className=''>
        <div>
          {cards.map((card) => (
            <div
              key={card.id}
              className={`z-10 flex flex-col items-center justify-between gap-10 pb-20 ${card.id % 2 === 1 ? 'md:flex-row' : 'md:flex-row-reverse'} `}
            >
              <div className='back-linear-3 max-w-2/3 basis-2/3 rounded-[24px] p-7'>
                <h3 className='t1_bold pb-5 pt-3 text-stroke-static'>
                  {card.title}
                </h3>
                <p className='t2_light pb-5 text-stroke-static'>{card.body}</p>

                <ul className='t2_light text-stroke-static'>
                  {card.items.map((item, i) => (
                    <li key={i}>
                      <span className='pl-3'>•</span>
                      {item}
                    </li>
                  ))}
                </ul>
              </div>

              <div className='relativeflex-shrink-0'>
                <Image
                  src={card.img}
                  alt=''
                  width={370}
                  height={370}
                  className=''
                />
              </div>
            </div>
          ))}
        </div>
      </section>
    </>
  );
}
